{
  "makaleler": [
    {
      "id": 1,
      "baslik": "Modern Web Tasarımında Minimalizm",
      "ozet": "Günümüz web tasarımında minimalist yaklaşımların önemi ve kullanıcı deneyimine etkileri üzerine detaylı bir inceleme.",
      "icerik": "Minimalizm, web tasarımında sadece gerekli olanı kullanarak maksimum etki yaratma sanatıdır. Bu yaklaşım, kullanıcıların dikkatini dağıtmadan ana mesaja odaklanmalarını sağlar.\n\nMinimalist tasarımın temel prensipleri:\n\n1. **Beyaz Alan Kullanımı**: Beyaz alan, tasarımda nefes aldıran ve içeriği öne çıkaran en önemli unsurdur.\n\n2. **Sınırlı Renk Paleti**: Az renk kullanarak güçlü bir görsel hiyerarşi oluşturmak mümkündür.\n\n3. **Tipografi Odaklı Tasarım**: Güçlü tipografi seçimleri, minimalist tasarımın temelini oluşturur.\n\n4. **Fonksiyonel Yaklaşım**: Her element bir amaca hizmet etmelidir.\n\nMinimalist web tasarımı, sadece estetik bir tercih değil, aynı zamanda kullanıcı deneyimini iyileştiren stratejik bir karardır.",
      "yazar": "Muhammed Yusuf ERTEK",
      "tarih": "2024-01-15",
      "kategori": "Tasarım",
      "etiketler": ["web tasarım", "minimalizm", "UX", "UI"],
      "okuma_suresi": 5,
      "gorsel": "/kader.jpg?height=400&width=800"
    },
    {
      "id": 2,
      "baslik": "JavaScript'te Asenkron Programlama",
      "ozet": "Promise, async/await ve callback yapıları ile JavaScript'te asenkron programlamanın incelikleri.",
      "icerik": "JavaScript'te asenkron programlama, modern web uygulamalarının temel taşlarından biridir. Bu yazıda, asenkron programlamanın farklı yöntemlerini ve en iyi uygulamalarını inceleyeceğiz.\n\n## Callback Fonksiyonları\n\nCallback'ler, JavaScript'te asenkron işlemlerin en temel yöntemidir:\n\n```javascript\nfunction veriGetir(callback) {\n  setTimeout(() => {\n    callback('Veri başarıyla getirildi!');\n  }, 1000);\n}\n```\n\n## Promise Yapısı\n\nPromise'ler, callback hell problemini çözmek için geliştirilmiştir:\n\n```javascript\nconst veriGetir = () => {\n  return new Promise((resolve, reject) => {\n    setTimeout(() => {\n      resolve('Veri başarıyla getirildi!');\n    }, 1000);\n  });\n};\n```\n\n## Async/Await\n\nModern JavaScript'te en temiz asenkron kod yazma yöntemi:\n\n```javascript\nasync function veriIsle() {\n  try {\n    const veri = await veriGetir();\n    console.log(veri);\n  } catch (hata) {\n    console.error(hata);\n  }\n}\n```\n\nAsenkron programlama, web uygulamalarının performansını artırır ve kullanıcı deneyimini iyileştirir.",
      "yazar": "Mehmet Demir",
      "tarih": "2024-01-10",
      "kategori": "Programlama",
      "etiketler": ["javascript", "async", "promise", "programlama"],
      "okuma_suresi": 8,
      "gorsel": "/sefaat1.jpg?height=400&width=800"
    },
    {
      "id": 3,
      "baslik": "CSS Grid ile Modern Layout Tasarımı",
      "ozet": "CSS Grid sisteminin gücü ve modern web sayfalarında layout oluşturmanın yeni yolları.",
      "icerik": "CSS Grid, web tasarımında devrim yaratan bir layout sistemidir. Flexbox'tan farklı olarak, iki boyutlu layout'lar oluşturmamıza olanak tanır.\n\n## Grid Container Oluşturma\n\nBir elementi grid container yapmak için:\n\n```css\n.container {\n  display: grid;\n  grid-template-columns: repeat(3, 1fr);\n  grid-template-rows: auto;\n  gap: 20px;\n}\n```\n\n## Grid Areas\n\nGrid areas ile semantic layout'lar oluşturabiliriz:\n\n```css\n.layout {\n  display: grid;\n  grid-template-areas:\n    'header header header'\n    'sidebar main main'\n    'footer footer footer';\n}\n\n.header { grid-area: header; }\n.sidebar { grid-area: sidebar; }\n.main { grid-area: main; }\n.footer { grid-area: footer; }\n```\n\n## Responsive Grid\n\nCSS Grid ile responsive tasarım:\n\n```css\n.responsive-grid {\n  display: grid;\n  grid-template-columns: repeat(auto-fit, minmax(300px, 1fr));\n  gap: 1rem;\n}\n```\n\nCSS Grid, karmaşık layout'ları basit ve anlaşılır kod ile oluşturmamızı sağlar.",
      "yazar": "Ayşe Kaya",
      "tarih": "2024-01-05",
      "kategori": "CSS",
      "etiketler": ["css", "grid", "layout", "responsive"],
      "okuma_suresi": 6,
      "gorsel": "/sızıntı.webp?height=400&width=800"
    },
    {
      "id": 4,
      "baslik": "React Hooks ile State Yönetimi",
      "ozet": "React Hooks'un gücü ve fonksiyonel komponentlerde state yönetiminin modern yaklaşımları.",
      "icerik": "React Hooks, fonksiyonel komponentlerde state ve lifecycle yönetimini mümkün kılan devrimci bir özelliktir.\n\n## useState Hook\n\nTemel state yönetimi için:\n\n```jsx\nimport { useState } from 'react';\n\nfunction Sayac() {\n  const [sayac, setSayac] = useState(0);\n\n  return (\n    <div>\n      <p>Sayaç: {sayac}</p>\n      <button onClick={() => setSayac(sayac + 1)}>\n        Artır\n      </button>\n    </div>\n  );\n}\n```\n\n## useEffect Hook\n\nSide effect'ler için:\n\n```jsx\nimport { useEffect, useState } from 'react';\n\nfunction VeriGetir() {\n  const [veri, setVeri] = useState(null);\n\n  useEffect(() => {\n    fetch('/api/veri')\n      .then(response => response.json())\n      .then(data => setVeri(data));\n  }, []);\n\n  return <div>{veri ? veri.mesaj : 'Yükleniyor...'}</div>;\n}\n```\n\n## Custom Hooks\n\nKendi hook'larımızı oluşturabiliriz:\n\n```jsx\nfunction useLocalStorage(key, initialValue) {\n  const [value, setValue] = useState(() => {\n    const item = localStorage.getItem(key);\n    return item ? JSON.parse(item) : initialValue;\n  });\n\n  const setStoredValue = (value) => {\n    setValue(value);\n    localStorage.setItem(key, JSON.stringify(value));\n  };\n\n  return [value, setStoredValue];\n}\n```\n\nReact Hooks, kod tekrarını azaltır ve komponent mantığını daha iyi organize etmemizi sağlar.",
      "yazar": "Can Özkan",
      "tarih": "2024-01-01",
      "kategori": "React",
      "etiketler": ["react", "hooks", "state", "javascript"],
      "okuma_suresi": 7,
      "gorsel": "/kandiller2.jpg?height=400&width=800"
    },
    {
      "id": 5,
      "baslik": "Node.js ile RESTful API Geliştirme",
      "ozet": "Node.js ve Express.js kullanarak modern RESTful API'ler oluşturmanın en iyi uygulamaları.",
      "icerik": "RESTful API'ler, modern web uygulamalarının omurgasını oluşturur. Node.js ile güçlü ve ölçeklenebilir API'ler geliştirebiliriz.\n\n## Express.js ile Başlangıç\n\nTemel bir Express sunucusu:\n\n```javascript\nconst express = require('express');\nconst app = express();\n\napp.use(express.json());\n\napp.get('/api/users', (req, res) => {\n  res.json({ message: 'Kullanıcılar listelendi' });\n});\n\napp.listen(3000, () => {\n  console.log('Sunucu 3000 portunda çalışıyor');\n});\n```\n\n## Middleware Kullanımı\n\nAuthentication middleware örneği:\n\n```javascript\nconst authenticateToken = (req, res, next) => {\n  const authHeader = req.headers['authorization'];\n  const token = authHeader && authHeader.split(' ')[1];\n\n  if (!token) {\n    return res.sendStatus(401);\n  }\n\n  jwt.verify(token, process.env.ACCESS_TOKEN_SECRET, (err, user) => {\n    if (err) return res.sendStatus(403);\n    req.user = user;\n    next();\n  });\n};\n```\n\n## Error Handling\n\nMerkezi hata yönetimi:\n\n```javascript\nconst errorHandler = (err, req, res, next) => {\n  console.error(err.stack);\n  \n  if (err.name === 'ValidationError') {\n    return res.status(400).json({ error: err.message });\n  }\n  \n  res.status(500).json({ error: 'Sunucu hatası' });\n};\n\napp.use(errorHandler);\n```\n\nNode.js ile API geliştirme, hızlı ve verimli backend çözümleri sunar.",
      "yazar": "Fatma Şen", 
      "tarih": "2023-12-28",
      "kategori": "Backend",
      "etiketler": ["nodejs", "express", "api", "backend"],
      "okuma_suresi": 9,
      "gorsel": "/sızıntı2.webp?height=400&width=800"
    },
    {
      "id": 6,
      "baslik": "TypeScript ile Tip Güvenli Geliştirme",
      "ozet": "TypeScript'in JavaScript geliştirme sürecine kattığı tip güvenliği ve geliştirici deneyimi iyileştirmeleri.",
      "icerik": "TypeScript, JavaScript'e statik tip kontrolü ekleyerek daha güvenli ve sürdürülebilir kod yazmamızı sağlar.\n\n## Temel Tipler\n\nTypeScript'te temel tip tanımlamaları:\n\n```typescript\nlet isim: string = 'Ahmet';\nlet yas: number = 25;\nlet aktif: boolean = true;\nlet hobbiler: string[] = ['okuma', 'yazılım'];\n```\n\n## Interface Tanımlamaları\n\nKarmaşık veri yapıları için:\n\n```typescript\ninterface Kullanici {\n  id: number;\n  isim: string;\n  email: string;\n  aktif?: boolean; // opsiyonel\n}\n\nfunction kullaniciOlustur(kullanici: Kullanici): Kullanici {\n  return {\n    ...kullanici,\n    aktif: kullanici.aktif ?? true\n  };\n}\n```\n\n## Generic Tipler\n\nYeniden kullanılabilir tip tanımlamaları:\n\n```typescript\ninterface ApiResponse<T> {\n  data: T;\n  success: boolean;\n  message: string;\n}\n\nfunction apiCagir<T>(url: string): Promise<ApiResponse<T>> {\n  return fetch(url).then(response => response.json());\n}\n```\n\n## Union ve Intersection Tipler\n\n```typescript\ntype Durum = 'bekliyor' | 'tamamlandi' | 'iptal';\n\ntype KullaniciDetay = Kullanici & {\n  sonGiris: Date;\n  roller: string[];\n};\n```\n\nTypeScript, büyük projelerde kod kalitesini artırır ve hataları geliştirme aşamasında yakalar.",
      "yazar": "Emre Yıldız",
      "tarih": "2023-12-25",
      "kategori": "TypeScript",
      "etiketler": ["typescript", "javascript", "tip güvenliği", "geliştirme"],
      "okuma_suresi": 8,
      "gorsel": "/sızıntı3.webp?height=400&width=800"
    },
    {
  "id": "7",
  "baslik": "KUR'AN YETER Mİ?",
  "ozet": "Kur’an İslam’da tek başına yeterli bir rehber midir? Yoksa hadis, sünnet, icma ve kıyas gibi kaynaklara da ihtiyaç var mı? Bu makalede, Kur’an’ın eksiksiz bir rehber olduğunu ayetlerle delillendirecek ve diğer kaynaklara yönelik eleştirileri inceleyeceğiz.",
  "icerik": "<div class=\"back-button\" onclick=\"showMainFeed()\" tabindex=\"0\" aria-label=\"Makalelere dön\"><svg class=\"w-5 h-5\" fill=\"none\" stroke=\"currentColor\" viewBox=\"0 0 24 24\"><path stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" d=\"M15 19l-7-7 7-7\"/></svg></div><img src=\"yeter.png\" alt=\"Kur'an'ın Yeterliliği\" class=\"article-page-image\"><h1 class=\"text-3xl font-bold mb-4 text-center\">KUR'AN YETER Mİ?</h1><p class=\"text-sm text-gray-500 mb-6 text-center\">Muhammed Yusuf Ertek • 08 Mayıs 2025</p><div class=\"article-page-content\"><p>Kur’an’ın İslâm’daki konumuyla ilgili en temel sorulardan biri, “Kur’an tek başına yeterli bir rehber midir, yoksa hadis, sünnet, icma ve kıyas gibi diğer kaynaklara da başvurulmalı mı?” şeklindedir. Bu makalede Kur’an’ın kendinde eksiksiz bir mesaj taşıdığı ve insanlığa yol göstermek için tam yetkin kılındığı görüşü savunulacak; hadis, sünnet, icma ve kıyas gibi kaynaklara dair eleştiriler ayrıntılı biçimde ele alınacaktır. Öncelikle akli ve ayetlerden hareketle Kur’an’ın kapsamlı yapısı vurgulanacak, ardından tarihsel süreçte hadislerin derlenmesi ve güvenilirliği irdelenecek; sünnet anlayışının evrimi, mezhepler arası farklılıklar ile icma ve kıaas uygulamalarına yönelik felsefi eleştiriler getirilecektir. Sonuçta, akıl ve vahiy çerçevesinde “sadece Kur’an kaynağı” yaklaşımının tutarlı bir zemini olduğu gösterilecektir.</p><h2>Kur’an’ın Tamlığı ve Açıklığı</h2><p>Allah Teâlâ, Kur’an’ı kullarına her konuda yeterli ve ayrıntılı bir rehber olarak indirdiğini çeşitli ayetlerde beyan etmiştir. Örneğin <strong><a href=\"https://sadecekuran.com.tr/#ayet-6-114\" style=\"color: var(--accent-color); font-weight: 600;\">En’âm Suresi 114</a></strong>'te Allah şöyle buyurur: “O size Kitab’ı ayrıntılı olarak indirmişken, Allah’tan başka bir hakem mi arayayım?”. Bu ayette Kur’an’ın “ayıntılı” olduğu, yani içinde hüküm vermek ve rehberlik etmek için gerekli her konunun açıklandığı vurgulanmaktadır. Benzer şekilde <strong><a href=\"https://sadecekuran.com.tr/#ayet-6-38\" style=\"color: var(--accent-color); font-weight: 600;\">En’âm 38</a></strong>’de Rab şöyle der: “Yeryüzünde yürüyen hiçbir canlı ve iki kanadıyla uçan hiçbir kuş yoktur ki, sizin gibi ümmetler olmasın. Biz Kitap’ta hiçbir şeyi eksik bırakmadık. Sonunda hepsi de Rablerinin huzurunda toplanacaklardır.”</p><p>Burada açıkça, Allah’ın Kitap’ta hiçbir hükmü veya bilgiyi eksik bırakmadığı söylenmektedir. Kur’an’ın tebliğinden, yorumundan ve delillerinden hiçbir şeyin eksik olmaması, onun inananlar için kendi başına yeterli olduğunu gösterir. Nitekim <strong><a href=\"https://sadecekuran.com.tr/#ayet-6-98\" style=\"color: var(--accent-color); font-weight: 600;\">En’âm 98</a></strong>’de: “Akleden bir topluluk için ayetlerimizi böylece ayrıntılı bir şekilde açıkladık.” denilerek Kur’an ayetlerinin bir bilme irfanına sahip topluluk için “ayrıntılı” ve açıklayıcı kılındığı belirtilir. Benzer ifadeler <strong><a href=\"https://sadecekuran.com.tr/#ayet-16-89\" style=\"color: var(--accent-color); font-weight: 600;\">Nahl 89</a></strong> ve <strong><a href=\"https://sadecekuran.com.tr/#ayet-36-69\" style=\"color: var(--accent-color); font-weight: 600;\">Yâsîn 69</a></strong> gibi diğer ayetlerde de görülür: “…Sana bu kitabı, her şeyi açıklayan, mü’minler için bir rehber, bir rahmet ve bir müjde olarak indirdik.” (<strong><a href=\"https://sadecekuran.com.tr/#ayet-16-89\" style=\"color: var(--accent-color); font-weight: 600;\">Nahl 16/89</a></strong>). “…Ona vahyedilen şey, bir öğüt ve apaçık bir Kur’an’dan başka bir şey değildir.” (<strong><a href=\"https://sadecekuran.com.tr/#ayet-36-69\" style=\"color: var(--accent-color); font-weight: 600;\">Yâsîn 36/69</a></strong>).</p><p>Ayrıca <strong><a href=\"https://sadecekuran.com.tr/#ayet-15-9\" style=\"color: var(--accent-color); font-weight: 600;\">Hicr Suresi 9</a></strong>’da Kur’an’ın Allah tarafından korunacağı vaadi vardır: “Şüphesiz, o hatırlatmayı Biz indirdik; yine onu muhafaza edicisi Biziz.” Bu ayetlerde açıkça Kur’an’ın eksiksiz olduğu, her şeyi kapsadığı ve Allah tarafından korunacağı beyan edilmektedir. Akıl açısından da bir Peygamber topluma rehberlik ediyorsa onu Allah’ın vahyine uygun şekilde yapması mantıki görülebilir. Dolayısıyla, Allah’ın “Kitabı ayrıntılı kıldı” demesi, başka bir vahiy veya kanuna ihtiyaç olmadan Kur’an’ın insanları doğru yola yönlendirmek için tam donanımlı olduğunu ifade eder.</p><h2>Hadislerin Derlenme Süreci ve Güvenilirliği</h2><p>Kur’an’ın detaylı rehberliğine rağmen, İslâm tarihinde Peygamberimizin söz ve davranışlarını (hadisleri) derleme süreçleri çok sonraki dönemlere rastlamıştır. Şöyle ki, Hz. Muhammed’in vefatından sonra ilk dört halife döneminde peygamber sözlerinin yazılmasına bile sıcak bakılmamış, hatta yasaklanmıştır. Bu döneme dair rivayetlere göre Ömer b. Hattâb, Peygamber ölürken “Bana kalem ve kağıt getirin, size benden sonra asla sapmayacağınız bir şey yazayım” denildiğinde, Ömer “Bu adam artık ağrılar içinde, Kur’an yanımızda ve o bize yeter” diyerek engel olmuştur. I. Halife Ebû Bekir de halktan toplanan hadisleri imha ettirmiş ve “Allah Resûlü’nden bir şey nakletmeyin, aranızda Allah’ın kitabı var, helalini helal, haramını haram kılın” diyerek, dinin korunmasının sadece Kur’an’a bağlı kalınmasıyla mümkün olacağını belirtmiştir. Üçüncü halife Osman da benzer gerekçelerle hadis yazımını kısıtlamıştır. Bu yasak, Ömer b. Abdulaziz zamanına (H.99) kadar devam etmiş, yani İslam’ın ilk bir buçuk asrında hadis yazımı genel olarak terk edilmiştir.</p><p>Ancak zamanla İslam coğrafyası genişleyip nesiller birbirinden uzaklaşınca, Peygamber’in hayatını doğrudan yaşayanların sayısı azaldı. İkinci ve üçüncü yüzyılda (Hicri 2.-3. yy) Ebû Bekir, Ömer ve Osman’ın ölümünden yaklaşık 200–300 yıl sonra hadisler sistemli olarak toplanıp yazıya geçirildi (örneğin Kütüb-i Sitte). Bu derlemeler, daha önce nesilden nesile geçen rivayetleri derleyen müelliflerce yapıldı. Oysa bu dönem, rivayet zincirlerinde sahihlik kriterlerinin oturmuş olduğu bir dönem değildi; bir rivayetin “sahih” sayılması için aranan şartlar daha sonra geliştirilmiştir. Bu durum, derlenen “milyonlarca hadis” içinden az sayıda hadisin seçilmesi anlamına gelmektedir.</p><p>Derleme sürecinin geç gerçekleşmesi, hadislerin güvenilirliğine dair şüpheleri artırır. Örneğin İbn Hacer, En-Nevî gibi hadis usûlü alimleri bile “hiçbir hadisin yüzde yüz kesin olmadığı”, yani ancak zan derecesinde (zannî) bilgi verdiği görüşündedir. Bu bakışa göre hiçbir haber (külli gayri muhtaç hiçbir haber) Resûlullah’a ait olduğunu ilmen kesin şekilde kanıtlayamaz; her rivayet bir ihtimal taşır. Müslüman hafızlar ne kadar titiz de olsa, nesilden nesile aktarılan hadislerde insan hatası, kasıtlı değişiklik veya muhabirlerin unutkanlığı gibi etkenlerin önüne geçmek zordur. Sonuçta “sahih” kabul edilen hadisler bile katîlik iddiası taşımaktan uzaktır. Bu da hadisleri mutlak surette bağlayıcı bir ilke yapmaya rasyonel bir temel bırakmaz.</p><img src=\"hadis.png\" alt=\"Hadislerin Derlenme Süreci\"><p>Hadis külliyatları, farklı toplulukların gereksinimlerine göre şekillenmiş; mezhep çekişmelerine alet edilmiştir. Bazı sahih hadisler arasındaki çelişkiler dikkat çekicidir. Örneğin bir rivayete göre “Hz. Peygamber oruçluyken hanımını öpmüş, öperken orucu bozulmamıştır”, başka rivayette “Bu durumda oruç bozulur” denir. Bu tip tutarsızlıklar usûl kitaplarında dahi tartışma konusu olmuştur. Uyuşmazlık halinde hangi rivayete uyulacağına dair çelişkili uygulamalar, hadis kaynaklarının Kur’an ile değil, daha çok meşreplerle şekillendiğini gösterir. Bir başka örnek, Hz. Peygamber’in hayatıyla ilgili rivayetlerdeki aşırı sayıda bilgi ve bazen de hurafe ve uydurma karışmasıdır. Bazı rivayetçiler mezhep imamlarını övecek, başkalarını yeren içerikler uydurabilmiş; böylece toplumsal ve siyasi amaçlara yönelik hadisler oluşmuştur. Bu nedenle cerh ve ta’zil usulü geliştirilip raviler “adil-zahip” gibi kıstaslarla sınıflandırılsa da mutlak bir güven sağlanmamıştır.</p><p>Bu noktada şu önemli hadisi kayıtlara geçirmek gerekir: Peygamberimiz vefatından önce, kendisi hakkında yazı yazdırma hususunda kesin bir ikazda bulunmuştur. Sahih Müslim’de nakledilen meşhur bir hadiste şöyle buyrulur: “Benden Kur’ân dışında hiçbir şey yazmayın. Kim benden Kur’ân dışında bir şey yazmışsa, onu imha etsin.” Bu söz, Allah’ın gönderdiği vahiy dışındaki kaynakların din dayanağı haline gelmesini engellemeyi amaçlamış, sünnetin peygamber hadisleri biçiminde kayıt altına alınmasını kesinlikle yasaklamıştır.</p><h2>Sünnetin Anlayışı ve İslam Usûlü</h2><p>“Sünnet” terimi klasik literatürde Hz. Peygamber’in yoluna, örnekliğine işaret eden genel bir kavram iken, zamanla hadislere dayanan hüküm koyucu bir kaynak haline getirilmiştir. Ancak Kur’an’da, Resûlullah’ın her sözünün bağlayıcı bir kaynak olduğu açıkça belirtilmemiştir. Kur’an’da “sünnet” kelimesi daha çok “bir topluluğun benimsemiş olduğu yol” anlamında kullanılmıştır; en meşhuru Allah Teâlâ’nın eski ümmetlerin sünnetlerini vazgeçirici hükümlere bağlayan ifadesidir. Dolayısıyla Kur’an’a göre esas bağlayıcı ölçü onun hükümleridir.</p><p>Bu bağlamda şunu vurgulamak gerekir: Peygamberimiz, Allah’ın indirdiği vahiy dışında hiçbir ilke veya kural getiremez. Eğer din için Kur’an’dan öte bir kaynak gerekli olsaydı, Allah buyruklarını tamamlamış olması gereken Resûl’üne bunu yazılı olarak kaydetmesini emrederdi ve Allah Teâlâ da bunun korumasını taahhüt ederdi. Kur’an’ın kendisi “insan için gereken, Allah’ın Kitabı’nın ötesine geçmez” diye açıklar. Böylece Hz. Peygamber’in yaşamı tamamen vahyi yansıtırken, hadisler ancak Kur’an’ın içinde kalan belirli konuları açıklamış demektir; Kur’an’da zikredilmeyen hususları ilave etme imkanı yoktur.</p><p>Mantık açısından bakıldığında da şu basit akıl yürütme yeterlidir: Hz. Muhammed, vahyi bütün insanlara ulaştırmakla görevlendirilmiş bir peygamberdir. Hayatı boyunca Kur’an’da yer alan emir ve yasakları eksiksiz uygulamış, Allah’ın kelamına asla muhalefet etmemiştir. O halde bir peygamber, kendisinden sonraki ümmeti Allah’ın hükmünden çıkarmak niyeti taşısa olur mu? Kur’an’ın bizzat “katı, apaçık bir Kur’an” olduğunu söylemesi (<strong><a href=\"https://sadecekuran.com.tr/#ayet-36-69\" style=\"color: var(--accent-color); font-weight: 600;\">Yâsîn 36/69</a></strong>) göz önünde tutulduğunda, hakkında şüphe duyulmayan Kur’an’ın dışına çıkmayı Allah Teâlâ kesinlikle mümkün görmemiştir. Ayrıca yukarıda alıntılanan hadiste ve Ömer ile Ebû Bekir’in uygulamalarında görüldüğü gibi, Peygamber’in ölümünden sonra bile Resûlullah’ın sözlerinin kitaplaştırılmasını engelleyen bir tutum hâkim olmuştur.</p><h2>İcma ve Kıyas Üzerine Eleştiriler</h2><p>Hukuk usulünün diğer iki ana kaynağı olan icma (ümmetin veya ulemanın ittifakı) ile kıyas (analojik hüküm çıkarımı) da Kur’an merkezli yaklaşım açısından sorunludur. Kur’an’da açıkça “icma” sözü geçmez; üstü kapalı tek ima beyan, farklı mezheplerde bile kati bir görüş olmaması gerektiğini gösterir: Dini sadece Allah’ın kitabına bağlamak gerektiğini söyleyen Kur’an, mezheplere bölünmeyi kınar (örneğin <strong><a href=\"https://sadecekuran.com.tr/#ayet-29-46\" style=\"color: var(--accent-color); font-weight: 600;\">Ankebut 29/46</a></strong>). İcma, tarihsel olarak sahih bir mutabakat göstermeye çok nadiren ulaşmıştır; farklı coğrafya ve zamanlardaki müçtehitler aynı meseleyi farklı yorumlayabilmiş, kesin bir birliği hiçbir zaman tutarlı biçimde sağlamış görünmemektedir. Felsefi olarak, bir konunun doğru çözümü için Allah’ın ancak Kitab’ında bildirdiği gibi mutlak deliller mevcuttur; insanlar arasında “icma” diye anılan çoğunluk görüşü, çoğu kez çoğunluğun bilgisizliğini ifade edebilir. Kur’an’da geçen “—Allah’ın Kitabı dışına uyanlar— Allah’tan korkarlar” gibi ibareler (Türkçe Meâl: <strong><a href=\"https://sadecekuran.com.tr/#ayet-16-91\" style=\"color: var(--accent-color); font-weight: 600;\">Nehl 16/91</a></strong>), hüküm koyma yetkisinin yalnızca Allah’a ait olduğunu düşündürür.</p><p>Kıyas ise tamamen beşeri bir akıl yürütmesidir: Var olan bir hükmün gerekçesine dayanılarak, benzer bir duruma hüküm uydurma işlemidir. Kıyasın tutarlı olabilmesi, kavranan hükmün gerçekte kaynağı olan hikmetin doğru anlaşılmasına bağlıdır. Oysa sadece Allah’ın bildirdiklerinden emin olabileceğimiz bir dinde, hükmün kaynağı insan eliyle tespit edilen benzerliklerle genişletilemez. Mantıken, Allah’ın Kur’an’ında açıkça hüküm verilmemişse, insanın bu konuda hüküm çıkarması heva ve hevesten öte bir şey olmayabilir. Nitekim (Kur’an dışı) kıyas yücelten her mezhep içinde, başka mezheplerin hükmünü reddeden hadislere dayanılmıştır. Bu durum, kıyasın kendisinin de mutlak güvenilir olmadığını gösterir. Sonuç olarak ilkelerin tek dayanak noktası Kur’an olmalı, kıyas ancak mecbur kalınan hususlarda gayrı kati bir yardımcı yöntem olarak kabullenilebilir.</p><h2>Tarihsel Süreç ve Mezhepsel Farklılıklar</h2><p>Kur’an merkezli yaklaşımın temelleri Hz. Peygamber’den sonra bazı âlim ve düşünürlerce atılmıştır. Abbasîler döneminde İbrahim Nazzam isimli bir ilim adamı, sözlü hadis otoritesini reddeden Nazzamiyye adlı bir mezhep kurmuştur. Onun çağdaşı olan İmam Şâfiî ve İbn Kuteybe gibi isimler ise bu görüşlere karşı çıkan risaleler kaleme almıştır.</p><p>19. yüzyılda Hindistan’da ortaya çıkan Ehl-i Kur’ân hareketi de, hadislerin aşırı vurgulanmasına tepkiyle şekillenmiştir. 20. yüzyıl başlarında Mısır’da Muhammed Tâvfik Sidkî gibi Kur’ân merkezli reformistler, “Kur’an tek başına İslâmdır” diyerek hadisleri eleştirmişlerdir. Sidkî, hadis kitaplarının peygamberden 200 yıla yakın sonra derlendiğini, bu sayısız gelenek arasında pek çok safsatanın sızabileceğini vurgulamıştır. Tek kaynağın Kur’an olduğunu, eğer İslam’a Kur’an dışı bir şey gerekseydi Peygamber’in bunu yazdırmasını ve Allah’ın da koruma garantisi vermesini beklerdi.</p><p>Günümüzde Sünnî âlimler altı büyük hadis kitabını (Sahiheyn, Sünenler vb.) delil görürken, Şiî âlimler farklı hadis külliyatları (el-Kâfî, Men la yehzuruhu’l-fakîh vb.) kullanır. İki gelenekteki aynı olay veya hükümle ilgili rivayetler farklılık gösterir. Mezhepler arası bu çatışma, hadislerin ne derece neviî inanç meselelerinde bile ne kadar değişik yorumlara yol açabileceğini ortaya koyar. Dolayısıyla mezheplerin dayandığı hadis koleksiyonları ve sünnet anlayışları arasında yeknesak bir “Kur’an dışı” kaynak birliği yoktur; bu da Kur’an dışı kaynaklara bağımlılığın doğasında tutarsızlık bulunduğunu gösterir.</p><h2>Mantık ve Akılcı Değerlendirme</h2><p>Aklî deliller açısından bakıldığında da sadece Kur’an’a yönelmek tutarlı görünür. İlahi vahiy olarak gönderilmiş ve Allah tarafından koruma vaadi verilmiş olan Kur’an’ın ihtiva ettiği bilgi, insan için temel olandır. Daha fazlasına ihtiyaç olduğunu varsaymak, hem vahyin ifadesiyle çatışır hem de peygamberin bahsi geçen hadislerdeki uyarısına (yalnızca Kur’an’ın yazılması gerektiği) aykırıdır. Ayrıca, “Allah size Kitab’ı ayrıntılı indirmişken, başka bir hakem mi arayayım?” (<strong><a href=\"https://sadecekuran.com.tr/#ayet-6-114\" style=\"color: var(--accent-color); font-weight: 600;\">En’âm 6/114</a></strong>) ayeti, insanları Kur’an dışına çıkaracak gerekçelerin gereksizliğini gösterir.</p><p>Kur’an, dürüstlük, adalet, merhamet gibi genel ahlâk ilkelerini açıklar; bunları hangi somut surete dönüştüreceğimiz ise bize bırakılmıştır. Sözgelimi yemek, giyim veya ibadet detayları konusunda Kur’an’da olmayan yorum ve uygulamaların %100 doğru olacağını bilmemiz imkânsızdır. Öte yandan Kur’an’da bizzat “Allah’a itaat, Resûl’e itaat” (<strong><a href=\"https://sadecekuran.com.tr/#ayet-4-59\" style=\"color: var(--accent-color); font-weight: 600;\">Nisâ 4/59</a></strong>) buyruğu geçse de, Peygamber’in görevini alevine hıyanet etmeden vahyi tebliğ etmek olarak anlamak mümkündür. Tefsirlerde yaygın görüş, bu ayette “Resûl” demenin aslında “Allah’ın vahyettiği hükümler” demek olduğu, doğrudan “yeni hüküm söyleme” anlamına gelmediğidir. Dahası <strong><a href=\"https://sadecekuran.com.tr/#ayet-4-59\" style=\"color: var(--accent-color); font-weight: 600;\">Nisâ 4/59</a></strong>’un devamında, aralarında anlaşmazlık doğduğunda meseleyi “Allah’a ve Resul’e götürün” denilmiştir. Bu, Kur’an’ın hükmünü ve onu açıklayan peygamber tavsiyesini esas almayı gerektirir; hadis külliyatındaki herhangi bir rivayet sıralaması veya kuralı değil. Aklen, Allah’ın koyduğu sınırların dışına çıkmadan Kur’an’a sarılmak; akıllara uygun, vahyin bütünlüğüne saygılı bir yaklaşımdır.</p><h2>Sonuç</h2><p>Sonuç olarak, İslâm’ın kaynakları konusunda akıl ve ayetler birlikte değerlendirildiğinde, Kur’an’ın tek ve yeterli kaynak olduğu sonucuna varmak makul ve tutarlı görünmektedir. Allah, Müslümanlara eksiksiz bir kitap vermiş, onu açıklamış ve koruyacağını vahetmiştir. Bu gerçeğin ışığında hadis ve sünnet külliyatlarına, ayrıca insan tarafından uydurulmuş olan icma ve kıyas gibi araçlara dayanmayı mutlak kabul etmek, ne tarihsel ne de akli olarak izah edilemez. Hadis derleyiciliğinin geç bir dönemde ve çatışmalı şartlarda ortaya çıkması, rivayetlerin çelişkili yapısı ve âlimlerin bu metinlere dair şüpheleri, sünnetin aslında Peygamber’e ait olup daha çok örnekliği tanımladığı dikkate alınmalıdır. Akıl ve mantık süzgecinden geçirildiğinde tek kaynak olarak Kur’an’a bağlı kalmak hem Allah’ın bildirdiği ilkelere hem de Hz. Peygamber’in vasiyetine en uygun yaklaşımdır. Bu yaklaşım, Kur’an’ın ifade ettiği temiz vahye uygunluğu korur ve Müslüman toplulukları kuranî birlik altında buluşturur.</p></div>",
  "yazar": "Muhammed Yusuf Ertek",
  "tarih": "2025-05-08",
  "kategori": "Araştırma",
  "etiketler": ["kuran", "hadis", "sünnet", "icma", "kıyas", "islam"],
  "okuma_suresi": 15,
  "gorsel": "yeter.png"
}
  	
  ]
}
